package com.yonghui.dict;


import com.github.houbb.heaven.util.lang.StringUtil;
import com.github.houbb.opencc4j.util.ZhConverterUtil;
import com.yonghui.jieba.JiebaSegmenter;
import com.yonghui.jieba.SegToken;
import com.yonghui.jieba.WordDictionary;
import org.junit.Test;

import java.util.List;
import java.util.Locale;

/**
 * @author jasonbiao
 * @date 2020-07-28 15:46
 * description: <p>
 *
 * </p>
 */
public class DictTest {

    private JiebaSegmenter segmenter = new JiebaSegmenter();

    String[] sentences =
            new String[] {
                    "汀沙村二大街   十一巷16號樓",
                    "富力城书香里玖棟1501",
                    "美城云庭16號樓二單元601",
                    "名桂园A9栋1-1#",
                    "西庄小区AB栋5-1-1",
                    "安岳县人民政府统一征地办公室2栋一单元502",
                    "仓山园生活区七栋501",
                    "半岛乐园A组团4栋13",
                    "恒立听海6栋10A",
                    "长宁县鑫盛&middot;滨江国际(竹都大道南)4栋1单元21-3",
                    "东原香郡二期8栋28-6",
                    "爱心家园7栋一单元401",
                    "万福花园D栋7单元5-2",
                    "崎上生活区3栋305",
                    "金科中央华府2栋203",
                    "君临东城26号楼201栋",
                    "贤圣路41号院一栋101",
                    "水韵书香14栋25-6",
                    "华鸿&middot;中央首府8栋2002室",
                    "雨韵阁-北门17栋609",
                    "新丰嘉园5栋一单元201",
                    "南苑小区209栋1单元302",
                    "蓝光蓝光&middot;中央天地2栋一单元1402",
                    "星海名城-一期5组团3栋8A",
                    "御景豪庭(花园东街)7栋三单元21&ndash;4",
                    "汤坑村汤坑老围村同富西路A5栋中建一局项目部",
                    "红群楼小区11号楼11栋1单元501",
                    "学府悦园E组团1栋23－11",
                    "蓝溪谷地二栋17-8",
                    "中兴商厦8栋505",
                    "滨江丽景美丽园17栋103室",
                    "信达东方蓝海-D区2栋1706",
                    "丽水澜庭A区1栋1603",
                    "芗城区沃尔玛九龙城(南昌路南)3栋4单元806",
                    "越秀&middot;滨海悦城6栋负一地下车库门口",
                    "三星锦城67896栋二单元16-4",
                    "立新花园5栋306",
                    "首开国风美域2栋3001",
                    "北城世纪城康徽苑15栋1601室",
                    "城建琥珀瑞安家园19栋2703",
                    "泉州恒大御景湾10栋2503",
                    "盛世嘉园(岷江大道东段)3栋二单元302",
                    "香格里拉A区32栋306室",
                    "绿苑&middot;阳光水岸B区24栋一单元",
                    "汇景&middot;华府-停车场8栋2501",
                    "春馨苑17栋3单元301",
                    "贝蒙天地15栋1426",
                    "东兴区邦泰国际社区(兰桂大道东)4栋1单元24楼2号",
                    "漾城4栋1604",
                    "鼎峰A13栋1403",
                    "保利香槟光华11栋2单元1505",
                    "华南花园a栋14",
                    "珠光雅苑一期2栋1203",
                    "福田区新阁小区(皇岗路东)林园东路新阁小区二栋114",
                    "忠仑公寓忠仑公寓B栋407",
                    "光明新区公明综合市场(宝长路北)综合市场右侧四栋（宏发粮油那栋）",
                    "博仕后家园-B区2栋612",
                    "天成小区A栋",
                    "秀峰景山佳园6栋1606",
                    "晨光花园31栋101",
                    "西豪逸景家园12号楼503（黄色楼体那栋，现在快递可进小区）",
                    "广福街道银顶街45号1栋二单元502",
                    "尧梭中学尧梭安置区29栋1单元",
                    "富强三村九栋6-4",
                    "市政综合楼蛇口油库3栋401",
                    "汪家桥小区13栋负2楼3号",
                    "南沙区龙光&middot;棕榈水岸2期(丰泽东路南)25栋401",
                    "贵尊苑17栋1601",
                    "御峰一期18栋1一4号",
                    "御道街124号小区124号2栋402室",
                    "升伟新天地C栋2单元4-2",
                    "翰苑颐园8栋2单元2210",
                    "银湖湾(虢国西路)E栋楼",
                    "名郡&middot;橘城首座E栋20-3",
                    "贵园北里-甲区13栋6单元502",
                    "保利花园-三期37栋501号",
                    "江宁区科学园天景山公寓(瑞庭苑)37栋205室",
                    "福州罗源湾海洋世界11栋503",
                    "东方名城禾郡6栋2503",
                    "紫云苑9号楼9栋乙单元202",
                    "卓越城一期4栋10楼",
                    "文化一至七村谢家湾正街文化六村12栋1单元8-1（谢家湾金茂小学正对面过斑马线上斜坡后左转走到尽头",
                    "湖贝新村148栋301",
                    "五凤兰庭三期23栋201",
                    "金融城二期富茂轩11栋7楼2号",
                    "城投&middot;紫云新城3栋701",
                    "渝北区礼义苑(礼仁街北)3号地7栋5单元。",
                    "家喜玻璃5栋2单元2-4从家喜玻璃巷子进来直走40米左手边就是",
                    "深圳市木材有限公司住宅区7栋752",
                    "天府长城&middot;嘉南地5栋803",
                    "孔雀城22栋1807",
                    "凰城华府58栋18－2",
                    "恒大绿洲129栋602",
                    "万向装饰建材城9栋6号普瑞特淋浴房",
                    "丰庭花园南街21栋",
                    "金源城金源橙郡8栋2单元705",
                    "滨湖万科城12栋402",
                    "人民商场宿舍抚琴小区-二幢永陵路29号3栋4单元10号",
                    "桐城市医药公司宿舍楼3栋305",
                    "合肥市乐农新村小学教育集团(蜀麓校区)华邦蜀山里15栋2904",
                    "福晟钱隆城10栋902",
                    "怡锦苑1栋B1一11--1",
                    "径贝新村61栋905",
                    "渝北区回兴橙瑰苑(锦华路南)3栋608",
                    "盛世商都七栋1602",
                    "财信城市国际6栋32-4",
                    "御溪城2栋23B",
                    "万达广场(南坪店)铂邸6栋1单元17-7",
                    "财信城市国际10栋23-5",
                    "三江希望城10栋13-2",
                    "公园道花园1栋2318",
                    "恒大中央广场一期住宅1栋503",
                    "山水家园9栋16-6",
                    "回龙观村-中区8栋3单元",
                    "果壳里的城5栋1单元304号房",
                    "华鸿&middot;中央首府8栋2002",
                    "龙登和城C区1栋2502",
                    "省直机关屏西住宅区40栋403",
                    "景馨园五栋一单元",
                    "富力桃园B区22栋2307",
                    "江岸东城中央9栋5&mdash;6",
                    "锦江&middot;城市花园三期4栋2单元25楼6号",
                    "美家美陶瓷外贸巷廉住房小区九栋一单元403号",
                    "融创御锦二期4栋3～5",
                    "梨园路小区合川南津街上什字梨园路341号1栋5单元3_2号",
                    "江与城原山时光93栋11-5",
                    "阳光上海城6栋503",
                    "康田&middot;漫城5栋10-3",
                    "两江嘉苑2栋3单元601",
                    "蓬安县紫苑&middot;阳光丽都(真武街西)真武街紫苑小区五栋2单元1-2",
                    "泉州&middot;中骏商城1栋1617",
                    "苍溪县九九祥鹤大院西南50米(桂花巷东)檬子树巷2号|栋|单元",
                    "桑园-西南门33栋704",
                    "美仙山美仙山花苑2期19栋2401",
                    "御源&middot;大湖区50栋四单元501",
                    "新华工贸大厦A1栋C梯601",
                    "聚福里聚福里13栋29-3",
                    "君贵东方瑞景11栋1单元901",
                    "榕信Ⅱ区5栋706",
                    "花果园-M区6栋3单元3306室",
                    "雅园新村18栋1503",
                    "首创鸿恩国际生活区3期-1栋2栋17-5",
                    "花牌坊社区交通巷36号7栋6单元3楼9号"
            };


    @Test
    public void testCutForIndex() {
        WordDictionary.getInstance().init();

        for (String sentence : sentences) {
            sentence = ZhConverterUtil.toSimple(sentence);
            sentence = StringUtil.trimAnyBlank(sentence);
            List<SegToken> tokens = segmenter.process(sentence, JiebaSegmenter.SegMode.SEARCH);
            System.out.print(String.format(Locale.getDefault(), "\n%s\n%s", sentence, tokens.toString()));
        }
    }

}
